Revit 2027 API
BuiltInFailures.SiteImportFailures.ContoursNoncontours Property
 The layers you have selected contain both contour lines and non-contour lines (lines of non-constant elevation). You may want to go back and select fewer layers, or you can continue, but the boundary of the site may be larger than you want.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ContoursNoncontours { get; }
Public Shared ReadOnly Property ContoursNoncontours As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ContoursNoncontours {
	FailureDefinitionId^ get ();
}
static member ContoursNoncontours : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SiteImportFailures Class
Autodesk.Revit.DB Namespace